// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time =10;
if (time >=0 && time<=14) {
    console.log('перша частина')
}
else if (time >=15 && time<=29) {
    console.log('друга частина')
}
else if (time >=30 && time<=44) {
    console.log('третя частина')
}
else if (time >=45 && time<=59) {
    console.log('четверта частина')
}
//
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = 15;
if (day >=0 && day <=9) {
    console.log('перша декада')
}
else if (day >=10 && day <=19) {
    console.log('друга декада')
}
else if (day >=20 && day <=31) {
    console.log('третя декада')
}
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = true
if (test) {
    console.log ('Вірно')
}
else {
    console.log ('Неправильно')
}
//
// let test = false;
// test ? console.log ('Вірно'): console.log ('Неправильно')
//
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let a = '-3';
if (a !== 0) {
    console.log('Вірно')
}
else {
    console.log('Невірно')
}
//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
let week = '7';
switch (week) {
    case '1':
        console.log('Лекція1')
        break;
    case '2':
        console.log('Практика1')
        break;
    case '3':
        console.log('Лекція2')
        break;
    case '4':
        console.log('Практика2')
        break;
    case '5':
        console.log('Лекція3')
        break;
    case '6':
        console.log('Аглійська мова')
        break;
    case '7':
        console.log('Вихідний')
        break;
}
//
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let  god = +prompt('Введіть рік')
if (god % 4 === 0) {
    console.log('Високосний рік')
}
else {
    console.log('Невисокосний рік')
}
//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let name = prompt ('Яка «офіційна» назва JavaScript?');
//     if (name == 'ECMAScript') {
//         console.log('Правильно!')
//     }
//     else {
//         console.log('Не знаєте? ECMAScript!')
//     }